In [92]:
import numpy as np
import pandas as pd

In [93]:
#dictionary:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [94]:
#list:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2_nocolumnsinfo = pd.DataFrame(data_list)
df2_nocolumnsinfo

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [95]:
#adding column info in list:
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

***selecting and indexing of Columns***

In [96]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [97]:
#single target
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [98]:
#multi target
df[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

***creating a new column***

In [99]:
df['Designation'] = ['doctor', 'engg', 'jobless', 'engg']

In [100]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000        engg
2  Peter   29    Berlin   62000     jobless
3  Linda   42    London   85000        engg

***removing a column***

In [101]:
#copy of real df
df.drop('Designation', axis=1) #axis=1 {for columns}

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [102]:
df #remains same

    Name  Age      City  Salary Designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000        engg
2  Peter   29    Berlin   62000     jobless
3  Linda   42    London   85000        engg

In [103]:
#now, on real data
df.drop('Designation', axis=1, inplace=True)

In [104]:
df #changes occur

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [105]:
#multiple drops:
df.drop(["Age",'Salary'], axis=1)

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

***removing rows***

In [106]:
#single drop:
df.drop(2,axis=0)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
3  Linda   42    London   85000

In [107]:
#multiple drop:
df.drop([0,1],axis=0)

    Name  Age    City  Salary
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

***selecting rows***

In [108]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [109]:
#single selection:
df.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [110]:
#index locating:
df.iloc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [111]:
#multiple selection:
df.loc[[0,3]]

    Name  Age      City  Salary
0   John   28  New York   65000
3  Linda   42    London   85000

***selecting subsets of rows & columns***

In [112]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [116]:
df[['Name','Age']].loc[[2,3]]

    Name  Age
2  Peter   29
3  Linda   42

***Conditional selection***

In [117]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [119]:
#people whose age is above 30
df[df['Age'] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
#people whose age is above 30 & their city must be paris
df[(df['Age']>30) & (df['City']=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

: